creeeeeeeeep/RED_light-stick/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 240MHz / 1kHz tick — 200Hz IMU 샘플링 지터를 줄이기 위해
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# ESP32-S3FH4R2 (4MB flash / 2MB PSRAM in-package)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# USB-Serial-JTAG 콘솔 (보드에 USB-UART 칩 없음)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 앱 파티션을 3MB 로 (기본 1MB 는 WiFi 스택 포함 시 여유가 없다)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA 로 구운 펌웨어가 부팅에 실패하면 이전 슬롯으로 되돌린다.
# 이게 없으면 잘못 구운 펌웨어 하나로 봉이 USB 없이는 못 살아난다.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# 배포 서버는 Cloudflare 터널 뒤 HTTPS 다. 인증서 번들이 있어야 붙는다.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_TLS_INSECURE=n
